In [1]:
#-------------------------------Data Summary-------------------------------
#Describe()- Used to get summary statistics in python.
#Describe Function gives the mean, std and IQR values.
#It analyzes both numeric and object series and also the DataFrame column sets of mixed data types.
# creation of DataFrame
import pandas as pd
import numpy as np

In [2]:
#Example 1:
a1 = pd.Series([1, 2, 3,4]) 
a1.describe()

count    4.000000
mean     2.500000
std      1.290994
min      1.000000
25%      1.750000
50%      2.500000
75%      3.250000
max      4.000000
dtype: float64

In [3]:
a2 = pd.Series(['q', 'r', 'r', 'r','q','s','p'])  
a2.describe()

count     7
unique    4
top       r
freq      3
dtype: object

In [4]:
info = pd.DataFrame({'numeric': [1, 2, 3, 4],  
'object': ['p', 'q', 'r','e']  
 })  
info

   numeric object
0        1      p
1        2      q
2        3      r
3        4      e

In [5]:
info.describe(include=[np.number])

        numeric
count  4.000000
mean   2.500000
std    1.290994
min    1.000000
25%    1.750000
50%    2.500000
75%    3.250000
max    4.000000

In [6]:
info.describe(include=[np.object])

C:\Users\Pranav\AppData\Local\Temp/ipykernel_8160/2611482831.py:1: DeprecationWarning: `np.object` is a deprecated alias for the builtin `object`. To silence this warning, use `object` by itself. Doing this will not modify any behavior and is safe.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  info.describe(include=[np.object])

       object
count       4
unique      4
top         p
freq        1

In [6]:
info.describe()

        numeric
count  4.000000
mean   2.500000
std    1.290994
min    1.000000
25%    1.750000
50%    2.500000
75%    3.250000
max    4.000000

In [7]:
#Example 2:
#Create a Dictionary of series
d = {'Name':['Cathrine','Alisa','Bobby','Madonna','Rocky','Sebastian','Jaqluine',
                       'Rahul','David','Andrew','Ajay','Teresa'],
'Age':[26,27,25,24,31,27,25,33,42,32,51,47],
'Score':[89,87,67,55,47,72,76,79,44,92,99,69]}

In [8]:
#Create a DataFrame
df = pd.DataFrame(d)

In [9]:
df

         Name  Age  Score
0    Cathrine   26     89
1       Alisa   27     87
2       Bobby   25     67
3     Madonna   24     55
4       Rocky   31     47
5   Sebastian   27     72
6    Jaqluine   25     76
7       Rahul   33     79
8       David   42     44
9      Andrew   32     92
10       Ajay   51     99
11     Teresa   47     69

In [10]:
#Descriptive or Summary Statistic of the numeric columns:
#Summary statistics
print(df.describe())

             Age      Score
count  12.000000  12.000000
mean   32.500000  73.000000
std     9.209679  17.653225
min    24.000000  44.000000
25%    25.750000  64.000000
50%    29.000000  74.000000
75%    35.250000  87.500000
max    51.000000  99.000000

In [12]:
#Descriptive or Summary Statistic of the character columns:
#Summary statistics of character column
print(df.describe(include='object'))

            Name
count         12
unique        12
top     Cathrine
freq           1

In [11]:
#Descriptive or Summary Statistic of all the columns
#Summary statistics of both - character & numerical columns
print(df.describe(include='all'))

            Name        Age      Score
count         12  12.000000  12.000000
unique        12        NaN        NaN
top     Cathrine        NaN        NaN
freq           1        NaN        NaN
mean         NaN  32.500000  73.000000
std          NaN   9.209679  17.653225
min          NaN  24.000000  44.000000
25%          NaN  25.750000  64.000000
50%          NaN  29.000000  74.000000
75%          NaN  35.250000  87.500000
max          NaN  51.000000  99.000000